In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = pd.read_csv("E://Assignment5.csv" ,names = ['employee', 'works_under'])
dataset

  employee works_under
0      Ram       Shyam
1    Shyam       Harry
2    Harry        Lucy
3     Lucy        Shiv
4     Shiv        Shiv
5     Jake        Hana
6     Hana       Beast
7    Beast       Beast
8    Shady       Shady
9      Nox         Nox

In [8]:
mydict = dict(zip(dataset.employee,dataset.works_under))
mydict

{'Ram': 'Shyam',
 'Shyam': 'Harry',
 'Harry': 'Lucy',
 'Lucy': 'Shiv',
 'Shiv': 'Shiv',
 'Jake': 'Hana',
 'Hana': 'Beast',
 'Beast': 'Beast',
 'Shady': 'Shady',
 'Nox': 'Nox'}

In [17]:
result = []
for key in mydict :
    temp = []
    temp.append(key)
    tempkey = key;
    while tempkey != mydict[tempkey] :
        tempkey = mydict[tempkey]
        temp.append(tempkey)
    result.append(temp)
result

[['Ram', 'Shyam', 'Harry', 'Lucy', 'Shiv'],
 ['Shyam', 'Harry', 'Lucy', 'Shiv'],
 ['Harry', 'Lucy', 'Shiv'],
 ['Lucy', 'Shiv'],
 ['Shiv'],
 ['Jake', 'Hana', 'Beast'],
 ['Hana', 'Beast'],
 ['Beast'],
 ['Shady'],
 ['Nox']]

In [18]:
hierarchy = pd.DataFrame(result)

In [19]:
hierarchy.fillna('')

       0      1      2     3     4
0    Ram  Shyam  Harry  Lucy  Shiv
1  Shyam  Harry   Lucy  Shiv
2  Harry   Lucy   Shiv
3   Lucy   Shiv
4   Shiv
5   Jake   Hana  Beast
6   Hana  Beast
7  Beast
8  Shady
9    Nox